app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails" ORDER BY "emails"."id" ASC
---
  def index
    @emails = Email.all

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2020-03-05 16:15:03.163474"], ["id", 50]]
---
  def show
    @email = Email.find(params[:id])
    @email.read = true
    @email.save

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @email = Email.new(object:Faker::Book.title,body:Faker::Hipster.paragraphs[0])
    if @email.save

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2020-03-05 16:30:00.215108"], ["id", 56]]
---
  def update
    @email = Email.find(params[:id])
    @email.update(read: !@email.read)