app/views/emails/create.js.erb

document.getElementById("email-list").insertAdjacentHTML("afterbegin", "<%= j render 'email', email: @email %>")
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "It's a Battlefield"], ["body", "There was never a genius without a tincture of madness."], ["created_at", "2020-03-05 10:17:23.065616"], ["updated_at", "2020-03-05 10:17:23.065616"]]