app/views/emails/update.js.erb

UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2020-03-05 16:30:00.215108"], ["id", 56]]
---
document.getElementById("email-<%= @email.id %>").classList.toggle("font-weight-bold");